Repository: taimiralain/FrontEnd
Catalog: src/locale/messages.*.xlf
Languages: es

# constructionName
source: Reservation System
es: Sistema de Reservaciones

# reservationFormButton
source: Create a Reservation
es: Crear Reservacion

# contactFormButton
source: Create a Contact
es: Crear Contacto

# reservationListButton
source: Reservations List
es: Lista de Reservaciones

# contactListButton
source: Contacts List
es: Lista de Contactos

# contactEditButton
source: Edit
es: Editar

# contactDeleteButton
source: Delete
es: Eliminar

source: Add to Fav+
es: Añadir a Fav

# reservationEditButton
source: Edit
es: Editar

# reservationDeleteButton
source: Delete
es: Eliminar

source: Sort By
es: Ordenar por

source: Contact Name ...
es: Nombre del Contacto

source: Contact Type
es: Tipo de Contacto

source: Contact Type 1
es: Tipo de Contacto 1

source: Contact Type 2
es: Tipo de Contacto 2

source: Contact Type 3
es: Tipo de Contacto 3

source: Phone Number
es: Número de Teléfono

source: Birth Date
es: Fecha de Nacimiento

source: Name is Required
es: El Nombre es requerido

source: Contact Type is Required
es: El Tipo de Contacto es requerido

source: Phone Number is Required
es: El Número de Teléfono es requerido

source: This number is not valid. Please fill the form again
es: Número inválido. Repita el fomulario

source: Number Phone requires at least {{form.get('phoneNumber').errors.minlength.requiredLength}} numbers
es: El Número de Telefono requiere al menos {{form.get('phoneNumber').errors.minlength.requiredLength}} dígitos

source: Number Phone requires no more than {{form.get('phoneNumber').errors.maxlength.requiredLength}} numbers
es: El Número de Teléfono requiere no más de {{form.get('phoneNumber').errors.maxlength.requiredLength}} dígitos

source: Birth Date is invalid. The Birth Date cannot be later than today
es: Fecha de Nacimiento inválida, debe ser anterior a este momento

source: Birth Date is required
es: Fecha de Nacimiento requerida

source: Submit
es: Enviar

source: Phone Number:
es: Número de Teléfono

source: Reservation Date
es: Fecha de Reservación

source: Reservation Date is required
es: Fecha de Reservación es requerida

source: Reservation Date invalid. The reservation date cannot be earlier than actual time
es: Fecha de Reservación inválida. No debe ser anterior a este momento.
